start_message = '''Приветствуем в нашем салоне красоты! 💇‍♀️💅✨

Мы рады видеть вас у нас и готовы предоставить широкий выбор услуг и товаров для вашей красоты и ухода.

Нажмите на одну из кнопок ниже, чтобы узнать подробнее:

🛍 Товары - для ознакомления с нашим ассортиментом профессиональной косметики и инструментов для ухода за собой.
💇‍♀️ Услуги - для выбора услуг из нашего списка, включающего стрижку, окрашивание, маникюр, педикюр и многие другие процедуры.
📍 Где мы находимся? - для просмотра адреса и расположения нашего салона на карте.
💬 Поддержка - если у вас остались вопросы или пожелания, напишите нам, и мы ответим в ближайшее время.

Спасибо, что выбрали наш салон красоты! Мы надеемся, что вам понравится наш сервис и вы останетесь довольны результатами. Если у вас остались вопросы или пожелания, не стесняйтесь написать нам.'''

# SECTION BOT MESSAGES HELP
help_message = '''Здравствуйте! 🤗 Мы рады помочь вам с любыми вопросами или пожеланиями.

Пожалуйста, напишите свой вопрос в этом чате, и наш менеджер ответит вам в ближайшее время. Если вам нужна срочная помощь, пожалуйста, сообщите об этом в своем сообщении.

Спасибо за обращение в наш салон красоты! Мы ценим ваше время и внимание. 💕'''

help_response_message = '''Спасибо за ваше сообщение! 🤗 Оно успешно отправлено нашим менеджерам.

Мы ценим ваше время и внимание, и стараемся обеспечить наилучшее качество обслуживания.

В ближайшее время наш менеджер свяжется с вами для решения вашего вопроса.'''

terms = 'Правила!'
item_title = 'Какой-то товар'
item_description = '\Крутейший товар'
successful_payment = 'Платеж на сумму `{total_amount} {currency}` совершен успешно!'

# SECTION BOT MESSAGES REGISTRATION
registration_success = 'Вы успешно зарегистрировались в нашей системе! 🎉🎉🎉'
registration_not_found ='Ой, кажется, вы еще не зарегистрированы в нашей системе! 🤔\nПожалуйста, предоставьте нам необходимые данные для регистрации. 📝'
registration_error = 'Ой, что-то пошло не так при регистрации. 😢 Пожалуйста, попробуйте снова. 🔄'

# SECTION BOT MESSAGES REQUESTED DATA
request_username = 'Пожалуйста, сообщите нам ваше полное имя: 👤'
request_phone_number = 'Пожалуйста, сообщите нам ваш номер телефона: 📞'
request_email =  'Пожалуйста, сообщите нам ваш email: 📧'

# SECTION BOT MESSAGES MAIN MENU
main_menu_message = '🏠 Вы вернулись в главное меню. Выберите нужную опцию.'

# SECTION BOT SERVICES MESSAGES
service_group_message = '💇‍♀️ Наши услуги для вашей красоты и ухода 💅'
service_message = '🧖‍♀️ Выберите услугу, которую Вы хотите забронировать:'
service_empty_message = '😕 К сожалению, в выбранном Вами зале нет доступных услуг.'

# SECTION BOT MESSAGES BOOKING
items_group_message = '💇‍♀️ Наши товары для вашей красоты и ухода 💅'
items_message = '🧖‍♀️ Выберите товар, которую Вы хотите купить:'
items_empty_message = '😕 К сожалению, все товары закончились.'

# SECTION BOT MESSAGES LOCATION
location_message = '''📍 Адрес:
Стахановская ул., 40, Ишимбай

📞 Контактная информация:
+7(917)799-17-03

💇‍♀️ Запись на посещение:
Если вам нужно записаться на посещение или уточнить информацию, пожалуйста, свяжитесь с нами по телефону или запишитесь в этом чате.

💆‍♀️ О нашем салоне красоты:
Наш салон красоты - это место, где вы сможете расслабиться и насладиться лучшими процедурами для вашей красоты и здоровья. Наши специалисты всегда готовы помочь вам выбрать подходящие услуги и проконсультировать по любым вопросам. Мы рады вас видеть!
'''

# SECTION HALL BOT MESSAGES
choise_hall_message = '''🏢 Выберите зал, который наилучшим образом подходит для Ваших потребностей:

🧔 Мужской зал - для наших сильных и уверенных в себе клиентов!

💇‍♀️ Женский зал - комфортное и уютное пространство для наших красивых клиенток!

👥 Общий зал - для тех, кто предпочитает проводить время в обществе друзей!
'''