help_message = 'Отправьте команду /buy, чтобы перейти к покупке.'
terms = 'Правила!'
item_title = 'Какой-то товар'
item_description = '\Крутейший товар'
successful_payment = 'Платеж на сумму `{total_amount} {currency}` совершен успешно!'

# SECTION BOT MESSAGES REGISTRATION
registration_success = 'Вы успешно зарегистрированы в нашей системе!'
registration_not_found = 'Вы не зарегистрированы в нашей системе!\n Пожалуйста, предоставьте нам необходимые данные для регистрации.'
registration_error = 'Произошла ошибка при регистрации. Пожалуйста, попробуйте снова.'

# SECTION BOT MESSAGES REQUESTED DATA
request_username = 'Ваше полное имя: '
request_phone_number = 'Ваш номер телефона: '
request_email = 'Ваш email: '

# SECTION BOT MESSAGES LOCATION
location = 'Мы находимя по адесу: \nСтахановская ул., 40, Ишимбай 🗺️\n\nНомер телефона: +7(917)799-17-03 📞'