start_message = """Приветствуем в нашем салоне красоты! 💇‍♀️💅✨

Мы рады видеть вас у нас и готовы предоставить широкий выбор услуг и товаров для вашей красоты и ухода.

Нажмите на одну из кнопок ниже, чтобы узнать подробнее:

🛍 Товары - для ознакомления с нашим ассортиментом профессиональной косметики и инструментов для ухода за собой.
💇‍♀️ Услуги - для выбора услуг из нашего списка, включающего стрижку, окрашивание, маникюр, педикюр и многие другие процедуры.
📍 Где мы находимся? - для просмотра адреса и расположения нашего салона на карте.
💬 Написать менеджеру - если у вас остались вопросы или пожелания, напишите нам, и мы ответим в ближайшее время.

Спасибо, что выбрали наш салон красоты! Мы надеемся, что вам понравится наш сервис и вы останетесь довольны результатами. Если у вас остались вопросы или пожелания, не стесняйтесь написать нам."""

admin_start_message = """

Здравствуйте, Администратор! 👩‍💻💇‍♀️✨

Добро пожаловать в нашу систему управления салоном красоты. Мы рады видеть вас здесь.

У вас есть следующие опции для управления товарами и услугами:

💈 Создать/изменить группу услуг - для создания или изменения категории услуг.

🎀 Создать/изменить группу товаров - для создания или изменения категории товаров.

💆‍♀️ Создать/изменить услугу - для создания или изменения услуги в существующей категории.

🛍️ Создать/изменить товар - для создания или изменения товара в существующей категории.

🎁 Товары - для просмотра списка товаров.

💇‍♀️ Услуги - для просмотра списка услуг.

📌 Список записанных пользователей - для просмотра списка пользователей, записанных на услуги.

Мы надеемся, что наша система управления облегчит вашу работу и поможет в эффективном управлении товарами и услугами. """

# SECTION BOT MESSAGES HELP
help_message = """Здравствуйте! 🤗 Мы рады помочь вам с любыми вопросами или пожеланиями.

Пожалуйста, напишите свой вопрос в этом чате, и наш менеджер ответит вам в ближайшее время. Если вам нужна срочная помощь, пожалуйста, сообщите об этом в своем сообщении.

Спасибо за обращение в наш салон красоты! Мы ценим ваше время и внимание. 💕"""

help_response_message = """Спасибо за ваше сообщение! 🤗 Оно успешно отправлено нашим менеджерам.

Мы ценим ваше время и внимание, и стараемся обеспечить наилучшее качество обслуживания.

В ближайшее время наш менеджер свяжется с вами для решения вашего вопроса."""

terms = "Правила!"
item_title = "Какой-то товар"
item_description = "\Крутейший товар"
successful_payment = "Платеж на сумму `{total_amount} {currency}` совершен успешно!"

# SECTION BOT MESSAGES REGISTRATION
registration_success = "Вы успешно зарегистрировались в нашей системе! 🎉🎉🎉"
registration_not_found = "Ой, кажется, вы еще не зарегистрированы в нашей системе! 🤔\nПожалуйста, предоставьте нам необходимые данные для регистрации. 📝"
registration_error = (
    "Ой, что-то пошло не так при регистрации. 😢 Пожалуйста, попробуйте снова. 🔄"
)

# SECTION BOT MESSAGES REQUESTED DATA
request_username = "Пожалуйста, сообщите нам ваше полное имя: 👤"
request_phone_number = "Пожалуйста, сообщите нам ваш номер телефона: 📞"
request_email = "Пожалуйста, сообщите нам ваш email: 📧"

# SECTION BOT MESSAGES MAIN MENU
main_menu_message = "🏠 Вы вернулись в главное меню. Выберите нужную опцию."

# SECTION BOT SERVICES MESSAGES
service_group_message = "💇‍♀️ Наши услуги для вашей красоты и ухода 💅"
service_message = "🧖‍♀️ Выберите услугу, которую Вы хотите забронировать:"
service_empty_message = "😕 К сожалению, в выбранном Вами зале нет доступных услуг."

# SECTION BOT MESSAGES BOOKING
items_group_message = """🌟 Мы гордимся тем, что продаем только товары от наших партнеров - надежных и известных брендов, которые специализируются на профессиональной косметике и инструментах для ухода за собой! 💆‍♀️💇‍♀️

🎁 Кроме того, мы рады сообщить, что для наших клиентов при заказе через нашего бота это выгоднее, чем при покупке в других местах. Наш бот предоставляет привлекательные скидки на наши товары, а также помогает быстро и легко оформить заказ. 🛍💰

🏠 Вы можете выбрать подходящие продукты для ваших потребностей и предпочтений, не выходя из дома. Выберите категорию товаров ниже, чтобы начать покупку! 👇"""
items_message = "🧖‍♀️ Выберите товар, которую Вы хотите купить:"
items_empty_message = "😕 К сожалению, все товары закончились."

# SECTION BOT MESSAGES LOCATION
location_message = """📍 Адрес:
Стахановская ул., 40, Ишимбай

📞 Контактная информация:
+7(917)799-17-03

💆‍♀️ О нашем салоне красоты:
Наш салон красоты - это место, где вы сможете расслабиться и насладиться лучшими процедурами для вашей красоты и здоровья. Наши специалисты всегда готовы помочь вам выбрать подходящие услуги и проконсультировать по любым вопросам. Мы рады вас видеть!
"""

# SECTION HALL BOT MESSAGES
choise_hall_message = """🏢 Выберите зал, который наилучшим образом подходит для Ваших потребностей:

🧔 Мужской зал - для наших сильных и уверенных в себе клиентов!

💇‍♀️ Женский зал - комфортное и уютное пространство для наших красивых клиенток!

👥 Общий зал - для тех, кто предпочитает проводить время в обществе друзей!
"""


# SECTION BOT MESSAGES ADMIN CREATE/EDIT
create_service_group_message = """💡 Для лучшей организации и управления группами услуг, вы можете создавать и изменять их. 

Это поможет вам и клиентам быстро находить нужные группы услуг. 🔍

Выберите действие: создать новую группу услуг или изменить существующую. ✏️"""

create_item_group_message = """💡 Для лучшей организации и управления группами товаров, вы можете создавать и изменять их. 

Это поможет вам и клиентам быстро находить нужные группы товаров. 🔍

Выберите действие: создать новую группу товаров или изменить существующую. ✏️"""

create_service_message = """💡 Для лучшей организации и управления услугами, вы можете создавать и изменять их. 

Это поможет вам и клиентам быстро находить нужные услуги. 🔍

Выберите действие: создать новую услугу или изменить существующую. ✏️"""

create_item_message = """💡 Для лучшей организации и управления товарами, вы можете создавать и изменять их. 

Это поможет вам и клиентам быстро находить нужные товары. 🔍

Выберите действие: создать новый товар или изменить существующий. ✏️"""


# SECTION BOT MESSAGES ADMIN DELETE

# SECTION BOT MESSAGES
create_new_service_group_message = "💡 Введите название новой группы сервисов. ✏️"
update_service_group_message= "💡 Выберите группу сервиса для изменения. ✏️"
create_new_service_group_description_message = "💡 Введите описание новой группы сервисов"
update_service_group_description_message = "💡 Введите описание для группы сервисов которую вы изменяете✏️"
create_new_service_group_active_message = "💡 Сделать новую группу сервисов активной?"
update_new_service_group_active_message = "💡 Сделать группу сервисов активной?"
create_new_service_choise_hall_message = "💡 Выберите зал, который наилучшим образом подходит для Ваших потребностей:"
update_service_choise_hall = "💡 Выберите зал, который наилучшим образом подходит для Ваших потребностей:"
delete_service_group_message = "💡 Выберите группу сервиса для удаления. 🗑️"

create_new_item_group_message = "💡 Введите название новой группы товаров. ✏️"
update_item_group_message= "💡 Выберите группу товаров для изменения. ✏️"
create_new_item_group_description_message = "💡 Введите описание новой группы товаров"
update_item_group_description_message = "💡 Введите описание для группы товаров которую вы изменяете✏️"
create_new_item_group_active_message = "💡 Сделать новую группу товаров активной?"
update_new_item_group_active_message = "💡 Сделать группу товаров активной?"
delete_item_group_message = "💡 Выберите группу товаров для удаления. 🗑️"

create_new_service_message = "💡 Введите название новой услуги. ✏️"
update_service_message = "💡 Выберите услугу для изменения. ✏️"
create_new_service_description_message = "💡 Введите описание новой услуги. ✏️"
update_service_price_message = "💡 Введите цену услуги. ✏️"
create_new_serivce_price_message = "💡 Введите цену новой услуги. ✏️"
create_new_service_group_message = "💡 Выберите группу услуги. ✏️"
create_new_serivce_active_message = "💡 Сделать новую услугу активной?"
update_new_service_active_message = "💡 Сделать услугу активной?"
delete_service_message = "💡 Выберите услугу для удаления. 🗑️"

create_new_item_message = "💡 Введите название нового товара. ✏️"
update_item_message = "💡 Выберите товар для изменения. ✏️"
create_new_item_description_message = "💡 Введите описание нового товара. ✏️"
update_item_description_message = "💡 Введите описание для товара которое вы изменяете. ✏️"
update_item_price_message = "💡 Введите цену товара. ✏️"
create_new_item_price_message = "💡 Введите цену нового товара. ✏️"
create_new_item_group_message = "💡 Выберите группу товара. ✏️"
create_new_item_active_message = "💡 Сделать новый товар активным?"
update_new_item_active_message = "💡 Сделать товар активным?"
create_new_item_quantity_message = "💡 Введите количество нового товара. ✏️"
update_new_item_quantity_message = "💡 Введите количество для товара которое вы изменяете. ✏️"
delete_item_message = "💡 Выберите товар для удаления. 🗑️"

# SECTION BOOKING 
choise_data_message = "💡 Выберите дату:"
choise_time_message = "💡 Выберите время:"
booking_seven_days_message = "💡 Запись на ближайшие 7 дней"